float pow2(float val) { return val * val; }

/* Реализовать функцию, которая возвращает подсчет площади квадрата. */

#include <iostream>

int main() {
  std::cout << pow2(6) << std::endl;
  return 0;
}